{
  "name": "Ashoka the Great",
  "title": "Emperor of the Maurya Dynasty | Chakravartin | Dharma Ashoka",
  "born": "Circa 304 BCE",
  "died": "Circa 232 BCE",
  "birthplace": "Pataliputra, Maurya Empire (modern-day Patna, India)",
  "affiliation": "Buddhism | Maurya Empire | Sanatana Dharma (early life)",
  "parents": "Bindusara (father), Subhadrangi (mother)",
  "image": "img/ashoka.jpg",
  "notableVows": [
    "To renounce violence after the Kalinga War",
    "To spread Buddhism and Dhamma throughout the world",
    "To rule with compassion, tolerance, and justice"
  ],
  "weapons": [
    "Military Might (early life)",
    "Dhamma (righteous path)",
    "Peace and Non-violence",
    "Moral Edicts"
  ],
  "traits": [
    "Transformative",
    "Compassionate",
    "Wise",
    "Tolerant",
    "Just",
    "Visionary"
  ],
  "bio": "Ashoka was the third emperor of the Maurya Dynasty and one of the greatest rulers in Indian history. Initially known for his military conquests, Ashoka’s transformation after the bloody Kalinga War is one of the most profound in history. Haunted by the suffering he caused, he embraced Buddhism and vowed to rule through Dhamma — a code of moral and ethical governance. He erected edicts across his empire to promote peace, tolerance, animal welfare, and respect among all religions. Ashoka became a beacon of righteous rule, and his legacy extends far beyond India.",
  "lifeSummary": "Ashoka began his reign as a fierce and ambitious warrior, expanding the Maurya Empire to its greatest extent. However, after witnessing the horrors of the Kalinga War, he underwent a deep moral awakening and renounced violence. He turned to Buddhism and dedicated the rest of his life to spreading peace, compassion, and Dharma. His edicts — inscribed on rocks and pillars — remain a testament to his ethical vision. Ashoka's reign became a golden chapter in Indian civilization, blending strength with compassion and leaving behind a timeless legacy of humane governance."
}