{
  "name": "Chanakya",
  "title": "Kautilya | Vishnugupta | Master Strategist and Philosopher",
  "born": "4th Century BCE",
  "died": "Approx. 283 BCE",
  "birthplace": "Takshashila (modern-day Pakistan)",
  "affiliation": "Arthashastra | Mauryan Empire | Sanatana Dharma",
  "parents": "Chanak (father), unknown (mother)",
  "image": "img/chanakya.jpg",
  "notableVows": [
    "To overthrow corrupt Nanda rule and establish righteous governance",
    "To guide Chandragupta Maurya and create a powerful unified empire",
    "To uphold Dharma through strategy, intellect, and diplomacy"
  ],
  "weapons": [
    "Political Strategy",
    "Economics and Statecraft",
    "Psychological Warfare",
    "Sharp Intellect"
  ],
  "traits": [
    "Brilliant",
    "Ruthless (when needed)",
    "Strategic",
    "Visionary",
    "Patriotic",
    "Philosophical"
  ],
  "bio": "Chanakya, also known as Kautilya or Vishnugupta, was a legendary Indian philosopher, teacher, economist, jurist, and royal advisor. He authored the *Arthashastra*, an ancient treatise on politics, economics, warfare, and governance. Born in Takshashila, he was a master strategist who played a critical role in establishing the Mauryan Empire by mentoring Chandragupta Maurya. He envisioned a strong and unified Bharat (India) governed by wisdom, discipline, and law. Chanakya’s principles on leadership, espionage, justice, and economics are still admired and studied today.",
  "lifeSummary": "Chanakya lived during a time of political chaos and foreign threat. After being insulted by the Nanda king, he vowed to bring about a just and powerful rule. With relentless determination, he identified and trained Chandragupta Maurya, toppling the Nandas and creating one of India’s greatest empires. His *Arthashastra* remains a masterpiece of ancient political science, outlining everything from diplomacy to warfare to taxation. Chanakya valued results and national welfare over sentiment, making him one of history’s greatest statecraft minds. His life teaches the power of intellect, discipline, and righteous ambition."
}