{
  "name": "Karna",
  "title": "Danveer, Radheya",
  "born": "Dvapara Yuga",
  "died": "Kurukshetra battlefield, Dvapara Yuga",
  "birthplace": "Unknown (born to Kunti before her marriage, abandoned on a river)",
  "affiliation": "Kauravas",
  "parents": "Surya (father), Kunti (mother), Adhiratha and Radha (foster parents)",
  "image": "img/karna.jpg",
  "notableVows": [
    "Never refused anyone who asked for charity",
    "Remained loyal to Duryodhana despite knowing the truth of his birth",
    "Fought with honor and stayed bound to dharma in his own way"
  ],
  "weapons": [
    "Vijaya Bow",
    "Divine Astras (Brahmastra, Nagastra, etc.)",
    "Kavacha and Kundala (divine armor and earrings)"
  ],
  "traits": [
    "Generous",
    "Loyal",
    "Proud",
    "Skilled warrior",
    "Tragic hero"
  ],
  "bio": "Karna was born to Kunti and the Sun God Surya before Kunti's marriage. Out of fear of social stigma, she abandoned him in a basket on a river, where he was raised by a charioteer’s family. Known for his extraordinary archery skills, Karna was denied respect due to his perceived low birth. He later became a close friend and loyal supporter of Duryodhana, who made him king of Anga. Karna's life was marked by immense generosity, inner conflict, and a deep yearning for respect and identity. Despite knowing he was the eldest Pandava, Karna chose to fight for Duryodhana out of loyalty and gratitude.",
  "lifeSummary": "Karna's life is one of the most poignant tales in the Mahabharata. Despite his noble birth, he was marginalized due to his foster family's status. Driven by pride and injustice, he sought recognition through mastery in archery and earned Lord Parashurama’s mentorship, albeit through deception. Karna’s unwavering loyalty to Duryodhana was both his strength and tragedy, as it placed him against his own brothers in the war. He was known for his unmatched generosity—giving away his divine armor and earrings to Indra, even knowing it would cost him his life. Karna died with his honor intact, remembered as one of the most tragic yet noble characters of the epic."
}