{
  "name": "Lord Krishna",
  "title": "Jagadguru | Govinda | Vasudeva",
  "born": "8th day of Krishna Paksha, Bhadrapada month (approx. 3228 BCE)",
  "died": "18 February 3102 BCE (start of Kali Yuga)",
  "birthplace": "Mathura, Uttar Pradesh, India",
  "affiliation": "Sanatana Dharma (Hinduism)",
  "parents": "Vasudeva (father), Devaki (mother); raised by Nanda and Yashoda",
  "image": "img/krishna.jpg",
  "notableVows": [
    "Protected dharma by guiding Pandavas and destroying adharma",
    "Never raised weapons in Kurukshetra but shaped the war as a charioteer and strategist",
    "Delivered the Bhagavad Gita to Arjuna and all of humanity"
  ],
  "weapons": [
    "Sudarshana Chakra",
    "Panchajanya Shankha",
    "Divine intellect",
    "Diplomacy"
  ],
  "traits": [
    "Playful",
    "Wise",
    "Strategic",
    "Loving",
    "Compassionate",
    "Detached"
  ],
  "bio": "Lord Krishna, the eighth avatar of Vishnu, is one of the most revered and beloved deities in Hinduism. Born in Mathura to destroy evil king Kamsa, Krishna was raised in the pastoral village of Gokul. His early life is filled with divine play (leelas), miracles, and profound love, especially with Radha. As an adult, he became a king, philosopher, diplomat, and friend to the Pandavas. In the Mahabharata, Krishna's role as Arjuna’s charioteer and the speaker of the Bhagavad Gita showcases his divine wisdom and guidance in the most complex moral situations.",
  "lifeSummary": "Krishna’s life embodies the complete spectrum of human and divine qualities—from mischievous child to enlightened teacher. He upheld righteousness while understanding the importance of compassion and strategy in a flawed world. His teachings in the Gita emphasize duty, detachment, devotion, and the pursuit of inner truth. Krishna was both a destroyer of evil and a nurturer of love and harmony. His legacy lives on as a symbol of divine love, cosmic play, and spiritual wisdom. His stories and teachings continue to inspire generations across all walks of life."
}