{
  "name": "Swami Vivekananda",
  "title": "Spiritual Leader | Monk | Vedantic Philosopher",
  "born": "12 January 1863",
  "died": "4 July 1902",
  "birthplace": "Calcutta, Bengal Presidency, British India (now Kolkata, India)",
  "affiliation": "Ramakrishna Order | Advaita Vedanta | Hinduism",
  "parents": "Vishwanath Datta (father), Bhuvaneshwari Devi (mother)",
  "image": "img/vivekananda.jpg",
  "notableVows": [
    "Spread the spiritual message of India and Vedanta to the West",
    "Uplift humanity through education, service, and self-realization",
    "Remain a celibate monk dedicated to truth and national awakening"
  ],
  "weapons": [
    "Fearless Speech",
    "Spiritual Wisdom",
    "Vedantic Philosophy",
    "Service to Humanity"
  ],
  "traits": [
    "Fearless",
    "Visionary",
    "Compassionate",
    "Spiritual",
    "Disciplined",
    "Charismatic"
  ],
  "bio": "Swami Vivekananda was a Hindu monk, philosopher, and the chief disciple of Sri Ramakrishna Paramahamsa. He played a crucial role in introducing Indian philosophies of Vedanta and Yoga to the Western world, especially through his historic speech at the Parliament of the World's Religions in Chicago in 1893. Dressed in saffron robes, he spoke of universal brotherhood, religious tolerance, and the divinity inherent in every soul. He emphasized the importance of self-confidence, service, and national pride. He founded the Ramakrishna Mission, an organization devoted to spiritual and social welfare.",
  "lifeSummary": "Born as Narendranath Datta, Vivekananda was deeply spiritual and intellectually curious from a young age. After meeting his guru, Sri Ramakrishna, he devoted himself to realizing the truth. His travels across India showed him the depth of spiritual wisdom and the pain of poverty and ignorance, inspiring him to dedicate his life to national upliftment. His powerful oratory, deep knowledge, and universal message left an indelible mark in both East and West. Swami Vivekananda died young but remains one of the most influential spiritual leaders in modern India and a source of inspiration for youth across the globe."
}